Revit 2024 API
IFCAnyHandle.TypeName Property
 The name of the type of the handle.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public string TypeName { get; }
Visual Basic
Public ReadOnly Property TypeName As String
	Get
Visual C++
public:
property String^ TypeName {
	String^ get ();
}
See Also
IFCAnyHandle Class
Autodesk.Revit.DB.IFC Namespace